extra/mindwave-emacs.org
***** Results table (basic)

|         |      signal | highGamma |  lowGamma |  highBeta |   lowBeta | highAlpha |  lowAlpha |     theta |     delta | meditation | attention |
|---------+-------------+-----------+-----------+-----------+-----------+-----------+-----------+-----------+-----------+------------+-----------|
| vmean   | 0.061611374 | 12192.720 | 15232.820 | 19399.642 | 15180.616 | 17033.287 | 22201.699 | 76134.531 | 270353.25 |  53.241706 | 53.424171 |
| vmedian |           0 |    8132.5 |     10014 |   14247.5 |    9695.5 |    8411.5 |    9076.5 |   23773.5 |     62936 |         54 |        56 |
| vmax    |          26 |     86970 |    152111 |    192200 |    260706 |    363667 |    799014 |    820033 |   2920134 |        100 |       100 |
| vmin    |           0 |       303 |       378 |       638 |       342 |       436 |       311 |      2025 |       300 |          0 |         0 |
| vsdev   |   1.2656602 | 12190.021 | 15797.156 | 17531.918 | 20699.664 | 29733.997 | 51731.083 | 124792.48 | 449634.67 |  22.641340 | 17.949459 |
|         |             |           |           |           |           |           |           |           |           |            |           |
	 #+TBLFM: @2$2=vmean(remote(bbreak,@II$2..@III$2))::@3$2=vmedian(remote(bbreak,@II$2..@III$2))::@4$2=vmax(remote(bbreak,@II$2..@III$2))::@5$2=vmin(remote(bbreak,@II$2..@III$2))::@6$2=vsdev(remote(bbreak,@II$2..@III$2))::@2$3=vmean(remote(bbreak,@II$3..@III$3))::@3$3=vmedian(remote(bbreak,@II$3..@III$3))::@4$3=vmax(remote(bbreak,@II$3..@III$3))::@5$3=vmin(remote(bbreak,@II$3..@III$3))::@6$3=vsdev(remote(bbreak,@II$3..@III$3))::@2$4=vmean(remote(bbreak,@II$4..@III$4))::@3$4=vmedian(remote(bbreak,@II$4..@III$4))::@4$4=vmax(remote(bbreak,@II$4..@III$4))::@5$4=vmin(remote(bbreak,@II$4..@III$4))::@6$4=vsdev(remote(bbreak,@II$4..@III$4))::@2$5=vmean(remote(bbreak,@II$5..@III$5))::@3$5=vmedian(remote(bbreak,@II$5..@III$5))::@4$5=vmax(remote(bbreak,@II$5..@III$5))::@5$5=vmin(remote(bbreak,@II$5..@III$5))::@6$5=vsdev(remote(bbreak,@II$5..@III$5))::@2$6=vmean(remote(bbreak,@II$6..@III$6))::@3$6=vmedian(remote(bbreak,@II$6..@III$6))::@4$6=vmax(remote(bbreak,@II$6..@III$6))::@5$6=vmin(remote(bbreak,@II$6..@III$6))::@6$6=vsdev(remote(bbreak,@II$6..@III$6))::@2$7=vmean(remote(bbreak,@II$7..@III$7))::@3$7=vmedian(remote(bbreak,@II$7..@III$7))::@4$7=vmax(remote(bbreak,@II$7..@III$7))::@5$7=vmin(remote(bbreak,@II$7..@III$7))::@6$7=vsdev(remote(bbreak,@II$7..@III$7))::@2$8=vmean(remote(bbreak,@II$8..@III$8))::@3$8=vmedian(remote(bbreak,@II$8..@III$8))::@4$8=vmax(remote(bbreak,@II$8..@III$8))::@5$8=vmin(remote(bbreak,@II$8..@III$8))::@6$8=vsdev(remote(bbreak,@II$8..@III$8))::@2$9=vmean(remote(bbreak,@II$9..@III$9))::@3$9=vmedian(remote(bbreak,@II$9..@III$9))::@4$9=vmax(remote(bbreak,@II$9..@III$9))::@5$9=vmin(remote(bbreak,@II$9..@III$9))::@6$9=vsdev(remote(bbreak,@II$9..@III$9))::@2$10=vmean(remote(bbreak,@II$10..@III$10))::@3$10=vmedian(remote(bbreak,@II$10..@III$10))::@4$10=vmax(remote(bbreak,@II$10..@III$10))::@5$10=vmin(remote(bbreak,@II$10..@III$10))::@6$10=vsdev(remote(bbreak,@II$10..@III$10))::@2$11=vmean(remote(bbreak,@II$11..@III$11))::@3$11=vmedian(remote(bbreak,@II$11..@III$11))::@4$11=vmax(remote(bbreak,@II$11..@III$11))::@5$11=vmin(remote(bbreak,@II$11..@III$11))::@6$11=vsdev(remote(bbreak,@II$11..@III$11))::@2$12=vmean(remote(bbreak,@II$12..@III$12))::@3$12=vmedian(remote(bbreak,@II$12..@III$12))::@4$12=vmax(remote(bbreak,@II$12..@III$12))::@5$12=vmin(remote(bbreak,@II$12..@III$12))::@6$12=vsdev(remote(bbreak,@II$12..@III$12))



**** Window for mark input
#+source dg-mark-window
#+begin_src emacs-lisp 
  (defun dg-mindwave/create-input-buffer ()
    "Create an input buffer so that marks can be handled"
    (interactive)
    (pop-to-buffer (get-buffer-create "*mindwave-input*") )
    (local-set-key " " 'dg-mindwave/generic-mark)
    (local-set-key "a" '(lambda () (interactive) (dg-mindwave/mark "a")))
    (local-set-key "b" '(lambda () (interactive) (dg-mindwave/mark "b")))
    (local-set-key "c" '(lambda () (interactive) (dg-mindwave/mark "c")))
    (local-set-key "d" '(lambda () (interactive) (dg-mindwave/mark "d")))
    (local-set-key "e" '(lambda () (interactive) (dg-mindwave/mark "e")))
    (local-set-key "f" '(lambda () (interactive) (dg-mindwave/mark "f")))
    (local-set-key "g" '(lambda () (interactive) (dg-mindwave/mark "g")))
    (local-set-key "h" '(lambda () (interactive) (dg-mindwave/mark "h")))
    (local-set-key "i" '(lambda () (interactive) (dg-mindwave/mark "i")))
    (local-set-key "j" '(lambda () (interactive) (dg-mindwave/mark "j")))
    (local-set-key "k" '(lambda () (interactive) (dg-mindwave/mark "k")))
    (local-set-key "l" '(lambda () (interactive) (dg-mindwave/mark "l")))
    (local-set-key "m" '(lambda () (interactive) (dg-mindwave/mark "m")))
    (local-set-key "n" '(lambda () (interactive) (dg-mindwave/mark "n")))
    (local-set-key "o" '(lambda () (interactive) (dg-mindwave/mark "o")))
    (local-set-key "p" '(lambda () (interactive) (dg-mindwave/mark "p")))
    (local-set-key "q" '(lambda () (interactive) (dg-mindwave/mark "q")))
    (local-set-key "r" '(lambda () (interactive) (dg-mindwave/mark "r")))
    (local-set-key "s" '(lambda () (interactive) (dg-mindwave/mark "s")))
    (local-set-key "t" '(lambda () (interactive) (dg-mindwave/mark "t")))
    (local-set-key "u" '(lambda () (interactive) (dg-mindwave/mark "u")))
    (local-set-key "v" '(lambda () (interactive) (dg-mindwave/mark "v")))
    (local-set-key "w" '(lambda () (interactive) (dg-mindwave/mark "w")))
    (local-set-key "x" '(lambda () (interactive) (dg-mindwave/mark "x")))
    (local-set-key "y" '(lambda () (interactive) (dg-mindwave/mark "y")))
    (local-set-key "z" '(lambda () (interactive) (dg-mindwave/mark "z"))))
  
#+end_src


**** Timed marks
#+source: dg-mark-timed
#+begin_src emacs-lisp
  (defun dg-mindwave/start-45-second-session (name) 
    "Start a 45 second session with appropriate marks.  NAME should be a simple name."
    (interactive "s45 Second Session Name:")
    (dg-mindwave/start-recording-session name)
    (run-at-time 15 nil '(lambda ()
                           (message "Close your Eyes and Relax")
                           (beep 1) 
                           (dg-mindwave/mark "relaxed")))
    (run-at-time 30 nil `(lambda ()
                           (message ,name)
                           (beep 1)
                           (dg-mindwave/mark ,name)))
    (run-at-time 45 nil '(lambda ()
                           (beep 1)
                           (message "stop")
                           (dg-mindwave/stop-recording-session))))
#+end_src
	 

*** Example two: solarized mind
#+begin_src emacs-lisp :tangle solarized-mind.el :noweb yes
;;; solarized-mind.el --- changes emacs interface according to brainstate

;; Copyright (C) 2012 Jonathan Arkell

;; Author: Jonathan Arkell <jonnay@jonnay.net>
;; Created: 16 June 2012
;; Keywords: comint mindwave

;; This file is not part of GNU Emacs.
;; Released under the GPL     

  (require 'mindwave-emacs)

#+end_src 

	Assuming you're using the solarized (dark) theme, lets say that you want the background color to change according to how attentive you are.
	
	- Attention :: Level of 'solarized purity of background color'.  The more attention, the more blue the solarized background.
	- Meditation :: Cursor blink rate, from 0.25 (less meditative) to 1 (more)

**** Set up Hooks

#+source: sm-hooksetup
#+begin_src emacs-lisp :tangle no
  (defun solarized-mind/mindwave-hook (vals)
    "Set up hook to solarize your mind, and set up the medicursor."
    (let ((brain (json-read-from-string vals)))
      (when (assoc 'eSense brain)
        (solarized-mind/set-medicursor (cdr (assoc 'meditation (assoc 'eSense brain))))
        (solarized-mind/set-background (cdr (assoc 'attention  (assoc 'eSense brain)))))))
  
  (defun solarized-mind/start ()
    (interactive)
    (mindwave-get-buffer)
    (when (not (member 'solarized-mind/mindwave-hook 'mindwave-hook))
      (message "Adding Mindwave hook")
      (add-hook 'mindwave-hook 'solarized-mind/mindwave-hook)))
  
  (defun solarized-mind/stop ()
    (interactive)
    (remove-hook 'mindwave-hook 'solarized-mind/mindwave-hook))
  
#+end_src


**** Medi-Curosr

	 This is by far the easiest one to do, so lets do it first.

#+source: sm-medicursor 
#+begin_src emacs-lisp :tangle no
  (defun solarized-mind/set-medicursor (med)
    "Set the cursor to a value from the mindwave"
    (setq blink-cursor-interval
          (if ( = 0 med)
              0.25
              (+ 0.25
                 (/ med 100.0)))))
#+end_src

#+begin_src emacs-lisp :tangle no
  (ert-deftest sm-medicursor/setValidRates ()
    (should (eql (solarized-mind/set-medicursor 100) 1.25))
    (should (eql (solarized-mind/set-medicursor 50) 0.75))
    (should (eql (solarized-mind/set-medicursor 0  ) 0.25)))
#+end_src

**** Solarized Mind
#+source: sm-solarizer
#+begin_src emacs-lisp :tangle no
    (require 'hexrgb)
  
  (defun solarized-mind/set-background (att)
    "Sets the background color"
    ;(set-frame-parameter nil 'background-color (solarized-mind/attention-to-rgb att))
    nil)
  
  ;(frame-parameter nil 'background-color)
  (defun solarized-mind/attention-to-rgb (att)
    "Takes an attention value (out of 100) and returns a color between #000000 and #002b36"
    (let ((h (hexrgb-hue "#002b36"))
          (s (hexrgb-saturation "#002b36"))
          (v (hexrgb-value "#002b36")))
      
                           (hexrgb-hsv-to-hex h 
                                              s 
                                              (* v (/ att 100.0)))))
#+end_src

#+begin_src emacs-lisp :tangle no
  (solarized-mind/attention-to-rgb 100)
  (solarized-mind/attention-to-rgb 50)
  (solarized-mind/attention-to-rgb 0)
  (set-frame-parameter nil 'background-color (solarized-mind/attention-to-rgb 0))
#+end_src

* Basic House keeping
#+begin_src emacs-lisp :tangle yes
(require 'json)
#+end_src

** Set up the client
*** Basic constants
#+begin_src emacs-lisp :tangle yes
  (defvar mindwave-host "localhost")
  (defvar mindwave-port 13854)
  
  (defvar mindwave-appName "mindwave-emacs")
  (defvar mindwave-appKey (sha1 mindwave-appName))
#+end_src

*** Connection
**** Connection variables

#+begin_src emacs-lisp :tangle yes
(defvar mindwave-buffer nil "Variable to store the buffer connected to the process")
(defvar mindwave-process nil "Process that mindwave is connected")
#+end_src

**** Return lowlevel connection variables 
According to the documentation of make-comint, if a running process is on the buffer, it is not restarted.  So isntead of trying to maintain state, lets just return the existing process that way.
 
#+begin_src emacs-lisp :tangle yes
  (defun mindwave-get-buffer ()
    "Returns the buffer for the mindwave connection"
    (if (and mindwave-process (process-live-p mindwave-process))
        mindwave-process
        (progn
    (setq mindwave-buffer (make-comint "mindwave" (cons mindwave-host mindwave-port)))
    (setq mindwave-process (get-buffer-process mindwave-buffer))
    (save-excursion
      (set-buffer mindwave-buffer)
      (sleep-for 1)
      (mindwave-authorize)
      (sleep-for 1)
      (mindwave-get-raw nil)
      (sleep-for 1)
      (add-hook 'comint-output-filter-functions 'mindwave-comint-filter-function nil t))
    mindwave-buffer)))
  
#+end_src

*** Sending Data
#+begin_src emacs-lisp :tangle yes
(defun mindwave-send-string (str)
  "Helper function to send STRING directly to the mindwave.
Please use `mindwave-authorize' or `mindwave-get-raw' for user-level configuration."
  (comint-send-string mindwave-process str))
#+end_src
*** Recieving Data

Mindwave emacs sets up 3 hooks:  
*** The hooks
**** ~mindwave-hook~
Called whenever there is a packet that mindwave emacs doesn't natively understand.  The standard 1-packet-per-second packet is an example of this:
#+begin_src json
{
  "eSense":{
    "attention":47,
    "meditation":66
  },
  "eegPower":{
    "delta":4479,
    "theta":42897,
    "lowAlpha":6952,
    "highAlpha":21261,
    "lowBeta":14623,
    "highBeta":5238,
    "lowGamma":2546,
    "highGamma":2512
  },
  "poorSignalLevel":0
}
#+end_src
**** ~mindwave-blink-hook~
Called whenever the mindwave detects a blink.

**** ~mindwave-raw-hook~ 
Called for when raw packet data is recieved.  Note that many raw packets are recieved at a time, so teh hook is fed an array of strings.  Each string being the numeric raw value.

Note that due to the buffering involved, I am not so sure how much value there really is in the raw eeg value.  

