extra/gather-into-org.el


(defun dg-mindwave/start-45-second-session (name) 
  "Start a 45 second session with appropriate marks.  NAME should be a simple name."
  (interactive "s45 Second Session Name:")
  (dg-mindwave/start-recording-session name)
  (run-at-time 15 nil '(lambda ()
                         (message "Close your Eyes and Relax")
                         (beep 1) 
                         (dg-mindwave/mark "relaxed")))
  (run-at-time 30 nil `(lambda ()
                         (message ,name)
                         (beep 1)
                         (dg-mindwave/mark ,name)))
  (run-at-time 45 nil '(lambda ()
                         (beep 1)
                         (message "stop")
                         (dg-mindwave/stop-recording-session))))
