extra/mindwave-emacs.el

(defvar mindwave-host "localhost")
(defvar mindwave-port 13854)

(defvar mindwave-appName "mindwave-emacs")
(defvar mindwave-appKey (sha1 mindwave-appName))

(defvar mindwave-buffer nil "Variable to store the buffer connected to the process")
(defvar mindwave-process nil "Process that mindwave is connected")

(defun mindwave-get-buffer ()
  "Returns the buffer for the mindwave connection"
  (if (and mindwave-process (process-live-p mindwave-process))
      mindwave-process
      (progn
  (setq mindwave-buffer (make-comint "mindwave" (cons mindwave-host mindwave-port)))
  (setq mindwave-process (get-buffer-process mindwave-buffer))
  (save-excursion
    (set-buffer mindwave-buffer)
    (sleep-for 1)
    (mindwave-authorize)
    (sleep-for 1)
    (mindwave-get-raw nil)
    (sleep-for 1)
    (add-hook 'comint-output-filter-functions 'mindwave-comint-filter-function nil t))
  mindwave-buffer)))

(defun mindwave-send-string (str)
  "Helper function to send STRING directly to the mindwave.
Please use `mindwave-authorize' or `mindwave-get-raw' for user-level configuration."
  (comint-send-string mindwave-process str))
