extra/mindwave-emacs.el

(defvar mindwave-hook '() "Hooks to run when mindwave gets standard input")
(defvar mindwave-blink-hook '() "Hooks to run when mindwave gets blink input")
(defvar mindwave-raw-hook '() "Hooks to run when mindwave gets raw input")

(defun mindwave-comint-filter-function (output)
  "A helper hook to pass off output to the apropriate hooks"
  (let ((collected-raw '()))
    (loop for out 
          in (split-string output "\C-j" t)
          do
          (cond ((and (> (length out) 10) 
                      (string-equal (substring out 0 10) "{\"rawEeg\":"))
                 (setq collected-raw (cons (substring out 10 -1) collected-raw)))
                
                ((and (> (length out) 17) 
                      (string-equal (substring out 0 17) "{\"blinkStrength\":"))
                 (run-hook-with-args 'mindwave-blink-hook (substring out 17 -2)))
                
                ((string-equal "{" (substring out 0 1))
                 (run-hook-with-args 'mindwave-hook out))))
    (when (> (length collected-raw) 0)
      (run-hook-with-args 'mindwave-raw-hook collected-raw)))
  output)

(defvar mindwave-authorized-p nil "whether or not app is authorized")

(defun mindwave-authorize () 
  "provides an autorization request to the mindwave server"
  (mindwave-send-string (json-encode `(("appName" . ,mindwave-appName) 
                                       ("appKey" . ,mindwave-appKey)))))

(defun mindwave-get-raw (raw)
  "Return raw output from mindwave.
RAW is a boolean value as to whether or not to listen for raw values"
  (mindwave-send-string (json-encode `(("enableRawOutput" . ,(if raw t json-false))
                                      ("format" . "Json")))))
